src/cf/Documents/РасходыНаОнлайнКассыУменьшающиеНалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходыНаОнлайнКассыУменьшающиеНалоги</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходыНаОнлайнКассыУменьшающиеНалоги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УменьшаемыйНалог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговУменьшаемыхНаРасходыККТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВидыНалоговУменьшаемыхНаРасходыККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыНалоговУменьшаемыхНаРасходыККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Патент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/РасходыНаОнлайнКассыУменьшающиеНалоги/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует строку содержащую текст запроса.
// Возвращаемое значение:
//   Строка
Функция ПолучитьТекстЗапросаИнициализироватьДанныеДокумента() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Ссылка КАК Ссылка,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.ПометкаУдаления КАК ПометкаУдаления,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Номер КАК Номер,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.ДатаРегистрации КАК Дата,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Проведен КАК Проведен,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.УменьшаемыйНалог КАК УменьшаемыйНалог,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Организация КАК Организация,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Модель КАК Модель,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.ЗаводскойНомер КАК ЗаводскойНомер,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.ДатаРегистрации КАК ДатаРегистрации,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.РегистрационныйНомер КАК РегистрационныйНомер,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.СуммаДокумента КАК СуммаДокумента,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Комментарий КАК Комментарий,
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.РасходыНаОнлайнКассыУменьшающиеНалоги КАК РасходыНаОнлайнКассыУменьшающиеНалоги
	|ГДЕ
	|	РасходыНаОнлайнКассыУменьшающиеНалоги.Ссылка = &Ссылка";
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует структуру значений, содержащую данные по регистрации кассы для вычета.
// Возвращаемое значение:
//   Структура:
//   	* ДокументРасхода				- Неопределено
//   	* ДатаРегистрации				- Дата
//   	* СуммаДокумента				- Число
//   	* РегистрационныйНомер			- Строка
//   	* ЗаводскойНомер				- Строка
//   	* Модель						- Строка
//   	* РегистрацияВНалоговомОргане	- Неопределено
//   	* Организация					- Неопределено
//   	* УменьшаемыйНалог				- Число
Функция НовыйИнформацияПоДокументуРасходов() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ДокументРасхода", 				Неопределено);
	Результат.Вставить("ДатаРегистрации", 				Дата(1,1,1));
	Результат.Вставить("СуммаДокумента", 				0);
	Результат.Вставить("РегистрационныйНомер", 			""); 
	Результат.Вставить("ЗаводскойНомер", 				""); 
	Результат.Вставить("Модель", 						""); 
    Результат.Вставить("РегистрацияВНалоговомОргане",	Неопределено);
	Результат.Вставить("Организация", 					Неопределено);
	Результат.Вставить("УменьшаемыйНалог", 				0);
	
	Возврат Результат;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
// Параметры:
// 	Ограничение - Структура
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

// Формирует таблицу данных документа.
//
// Параметры:
//	ДокументСсылка - ДокументСсылка.РасходыНаОнлайнКассыУменьшающиеНалоги - Текущий документ
//	СтруктураДополнительныеСвойства  - Структура - Дополнительные свойства документа
//	
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст = ПолучитьТекстЗапросаИнициализироватьДанныеДокумента();	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.ВыполнитьПакет();
	
	СформироватьТаблицаРасходыНаОнлайнКассыУменьшающиеНалоги(ДокументСсылка, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Функция ПределРасходовНаОнлайнКассу() Экспорт
	
	Возврат 28000;
	
КонецФункции

Функция МаксимальнаяДатаРегистрацииКассы() Экспорт
	
	Возврат КонецДня(Дата(2025, 12, 31));
	
КонецФункции

Функция МинимальнаяДатаРегистрацииКассы() Экспорт
	
	Возврат Дата(2024, 1, 1);
	
КонецФункции

Функция ПолучитьАктуальныйДокументРасходов(Организация, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.Ссылка КАК ДокументРасхода,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.ДатаРегистрации КАК ДатаРегистрации,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.СуммаДокумента КАК СуммаДокумента,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.РегистрационныйНомер КАК РегистрационныйНомер,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.ЗаводскойНомер КАК ЗаводскойНомер,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.Модель КАК Модель,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.Организация КАК Организация,
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.УменьшаемыйНалог КАК УменьшаемыйНалог
		|ИЗ
		|	Документ.РасходыНаОнлайнКассыУменьшающиеНалоги КАК РасходыНаОнлайнКассыУменьшающиеНалоги
		|ГДЕ
		|	РасходыНаОнлайнКассыУменьшающиеНалоги.Проведен
		|	И РасходыНаОнлайнКассыУменьшающиеНалоги.Организация = &Организация
		|	И РасходыНаОнлайнКассыУменьшающиеНалоги.ДатаРегистрации <= &Дата";
	
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	СтруктураВозврата = НовыйИнформацияПоДокументуРасходов();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);	
	КонецЦикла;
	
	Возврат СтруктураВозврата;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасходыНаОнлайнКассыУменьшающиеНалоги(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("РасходНаОнлайнКассыУменьшающиеНалоги", НСтр("ru='Расход на онлайн кассы уменьшающие налоги'")); 
	Запрос.УстановитьПараметр("СистемаНалогообложения", Перечисления.ВидыНалоговУменьшаемыхНаРасходыККТ.УСН);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ВЫРАЗИТЬ(&РасходНаОнлайнКассыУменьшающиеНалоги КАК СТРОКА(100)) КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВременнаяТаблицаШапка.Дата КАК Дата,
	|	ВременнаяТаблицаШапка.Дата КАК Период,
	|	ВременнаяТаблицаШапка.Организация КАК Организация,
	|	ВременнаяТаблицаШапка.СуммаДокумента КАК Сумма,
	|	ВременнаяТаблицаШапка.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ВременнаяТаблицаШапка.Ссылка КАК ДокументРасхода,
	|	&СистемаНалогообложения КАК СистемаНалогообложения
	|ИЗ
	|	ВременнаяТаблицаШапка КАК ВременнаяТаблицаШапка";
	
	Запрос.Выполнить();
	
	НомерЗапроса = 0;
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходыНаОнлайнКассыУменьшающиеНалоги", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДенежныеСредства()

#Область ОбработчикиОбновления
#КонецОбласти

#КонецОбласти

#КонецЕсли
